app/Controllers/Auth.php

    public function cekLogin()
    {
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = md5($this->request->getPost('password'));

        $user = $userModel->where('email', $email)->where('password', $password)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'frmnnurilhaq@gmail.com'
AND `password` = '202cb962ac59075b964b07152d234b70'
 LIMIT 1