app/Controllers/Home.php

SELECT `pemesanan`.*, `user`.`nama_lengkap`
FROM `pemesanan`
LEFT JOIN `user` ON `user`.`id_user` = `pemesanan`.`id_user`
WHERE `pemesanan`.`status` = 'produksi'
ORDER BY `pemesanan`.`tanggal` ASC
SELECT `detail_pemesanan`.*, `produk`.`nama_produk`, `produk`.`ukuran`
FROM `detail_pemesanan`
LEFT JOIN `produk` ON `produk`.`id_produk` = `detail_pemesanan`.`id_produk`
WHERE `detail_pemesanan`.`id_pemesanan` = '69'
---
    public function index()
    {
        $session = session();

        if (!$session->has('user')) {
            return redirect()->to('/login');
        }

        $user = $session->get('user');
        $data = [];
        $db = Database::connect();

        // 2. Siapkan model promo
        $promoModel = new PromoModel();

        if ($user['role'] === 'pemilik') {
            // Logika untuk Pemilik (Admin) - Tidak diubah
            $getOrdersByStatus = function ($status) use ($db) {
                $pemesanan = $db->table('pemesanan')
                    ->select('pemesanan.*, user.nama_lengkap')
                    ->join('user', 'user.id_user = pemesanan.id_user', 'left')
                    ->where('pemesanan.status', $status)
                    ->orderBy('pemesanan.tanggal', 'asc')
                    ->get()
                    ->getResultArray();

                foreach ($pemesanan as $key => $order) {
                    $details = $db->table('detail_pemesanan')
                        ->select('detail_pemesanan.*, produk.nama_produk, produk.ukuran')
                        ->join('produk', 'produk.id_produk = detail_pemesanan.id_produk', 'left')
                        ->where('detail_pemesanan.id_pemesanan', $order['id_pemesanan'])
                        ->get()
                        ->getResultArray();

SELECT *
FROM `promo`
ORDER BY `status` ASC
SELECT `pemesanan`.*
FROM `pemesanan`
WHERE `pemesanan`.`id_user` = '5'
AND `pemesanan`.`status` IN ('produksi','siap kirim')
ORDER BY `pemesanan`.`tanggal` DESC
SELECT `detail_pemesanan`.*, `produk`.`nama_produk`, `produk`.`ukuran`
FROM `detail_pemesanan`
LEFT JOIN `produk` ON `produk`.`id_produk` = `detail_pemesanan`.`id_produk`
WHERE `detail_pemesanan`.`id_pemesanan` = '72'
---
            $data['siap_kirim'] = $getOrdersByStatus('siap kirim');

            // 3. Ambil semua data promo untuk tabel CRUD di beranda pemilik
            $data['promos'] = $promoModel->orderBy('status', 'ASC')->findAll();
        } elseif ($user['role'] === 'pelanggan') {
            // LOGIKA UNTUK PELANGGAN
            $pemesanan = $db->table('pemesanan')
                ->select('pemesanan.*')
                ->where('pemesanan.id_user', $user['id_user'])
                ->whereIn('pemesanan.status', ['produksi', 'siap kirim'])
                ->orderBy('pemesanan.tanggal', 'DESC')
                ->get()
                ->getResultArray();

            // Untuk setiap pesanan, ambil detail item produknya
            foreach ($pemesanan as $key => $order) {
                $details = $db->table('detail_pemesanan')
                    ->select('detail_pemesanan.*, produk.nama_produk, produk.ukuran')
                    ->join('produk', 'produk.id_produk = detail_pemesanan.id_produk', 'left')
                    ->where('detail_pemesanan.id_pemesanan', $order['id_pemesanan'])
                    ->get()
                    ->getResultArray();

SELECT *
FROM `promo`
WHERE `status` = 'aktif'
 LIMIT 1
---
            $data['pesanan_berjalan'] = $pemesanan;

            // 4. Ambil data promo yang aktif untuk ditampilkan di modal promo pelanggan
            $data['promoAktif'] = $promoModel->where('status', 'aktif')->first();