app/Controllers/Laporan.php

SELECT `riwayat_transaksi`.*, `user`.`nama_lengkap`
FROM `riwayat_transaksi`
LEFT JOIN `user` ON `user`.`id_user` = `riwayat_transaksi`.`id_user`
WHERE `tanggal_selesai` >= '2025-07-01 00:00:00'
AND `tanggal_selesai` <= '2025-07-31 23:59:59'
ORDER BY `tanggal_selesai` DESC
---
    public function index()
    {
        $riwayatModel = new RiwayatTransaksiModel();

        // Ambil filter dari URL
        $filterBulan = $this->request->getGet('bulan') ?? date('Y-m');
        $filterSort = $this->request->getGet('sort') ?? 'terbaru';
        $filterModal = $this->request->getGet('modal') ?? 0; // Ambil nilai modal, default 0

        // Tentukan tanggal awal dan akhir bulan
        $tanggalAwal = $filterBulan . '-01';
        $tanggalAkhir = date('Y-m-t', strtotime($tanggalAwal));

        // Query untuk detail riwayat
        $builder = $riwayatModel
            ->select('riwayat_transaksi.*, user.nama_lengkap')
            ->join('user', 'user.id_user = riwayat_transaksi.id_user', 'left')
            ->where('tanggal_selesai >=', $tanggalAwal . ' 00:00:00')
            ->where('tanggal_selesai <=', $tanggalAkhir . ' 23:59:59');

        if ($filterSort === 'terlama') {
            $builder->orderBy('tanggal_selesai', 'ASC');
        } else {
            $builder->orderBy('tanggal_selesai', 'DESC');
        }
        $data['riwayat'] = $builder->findAll();

        // Hitung total pendapatan untuk periode ini
        $totalPendapatanResult = $riwayatModel
            ->selectSum('total_harga', 'total')
            ->where('tanggal_selesai >=', $tanggalAwal . ' 00:00:00')
            ->where('tanggal_selesai <=', $tanggalAkhir . ' 23:59:59')
            ->get()->getRow();

SELECT `riwayat_transaksi`.*, `user`.`nama_lengkap`
FROM `riwayat_transaksi`
LEFT JOIN `user` ON `user`.`id_user` = `riwayat_transaksi`.`id_user`
WHERE `tanggal_selesai` >= '2025-07-01 00:00:00'
AND `tanggal_selesai` <= '2025-07-31 23:59:59'
ORDER BY `tanggal_selesai` ASC
---
    public function print()
    {
        $riwayatModel = new RiwayatTransaksiModel();
        $filterBulan = $this->request->getGet('bulan');
        $modal = $this->request->getGet('modal') ?? 0; // Ambil modal dari URL

        if (!$filterBulan) {
            return redirect()->to('/laporan')->with('error', 'Bulan untuk mencetak laporan harus dipilih.');
        }

        $tanggalAwal = $filterBulan . '-01';
        $tanggalAkhir = date('Y-m-t', strtotime($tanggalAwal));

        $data['laporan'] = $riwayatModel
            ->select('riwayat_transaksi.*, user.nama_lengkap')
            ->join('user', 'user.id_user = riwayat_transaksi.id_user', 'left')
            ->where('tanggal_selesai >=', $tanggalAwal . ' 00:00:00')
            ->where('tanggal_selesai <=', $tanggalAkhir . ' 23:59:59')
            ->orderBy('tanggal_selesai', 'ASC')
            ->findAll();