app/Controllers/Payment.php

UPDATE `pemesanan` SET `email_status` = 'Email Berhasil Terkirim'
WHERE `pemesanan`.`id_pemesanan` IN ('47')
---
            // 3. Kirim email konfirmasi ke pelanggan
            $this->_sendProductionEmail($pemesanan);
        } else if ($transactionStatus == 'cancel' || $transactionStatus == 'deny' || $transactionStatus == 'expire') {
            $pemesananModel->update($pemesanan['id_pemesanan'], ['status' => 'dibatalkan']);