app/Controllers/Pemesanan.php

SELECT *
FROM `resep_produk`
WHERE `id_produk` = '3'
---
    private function _getVirtualIngredientStock(): array
    {
        $stokModel = new StokModel();
        $resepModel = new ResepProdukModel();
        $keranjang = session()->get('keranjang') ?? [];
        $stokAsliDb = $stokModel->findAll();
        $stokVirtual = [];
        foreach ($stokAsliDb as $stok) {
            $stokVirtual[$stok['id_bahan']] = $stok['jumlah'];
        }
        if (!empty($keranjang)) {
            foreach ($keranjang as $item) {
                $resep = $resepModel->where('id_produk', $item['id_produk'])->findAll();

SELECT *
FROM `resep_produk`
WHERE `id_produk` = 1
---
    private function _hitungStokTersedia(int $id_produk, array $stokVirtual): int
    {
        $resepModel = new ResepProdukModel();
        $resep = $resepModel->where('id_produk', $id_produk)->findAll();

SELECT *
FROM `resep_produk`
WHERE `id_produk` = '1'
---
    private function _validasiStokKeranjang(array $keranjang)
    {
        if (empty($keranjang)) {
            return true;
        }
        $resepModel = new ResepProdukModel();
        $stokModel = new StokModel();
        $bahanDibutuhkan = [];
        foreach ($keranjang as $item) {
            $resep = $resepModel->where('id_produk', $item['id_produk'])->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '6'
---
    public function tambahKeKeranjang()
    {
        $id_produk = $this->request->getPost('id_produk');
        $jumlahDitambahkan = (int) $this->request->getPost('jumlah');
        if ($jumlahDitambahkan < 1) {
            return redirect()->back()->with('error', 'Jumlah tidak valid.');
        }

        $keranjang = session()->get('keranjang') ?? [];
        $keranjangHipotetis = $keranjang;

        if (isset($keranjangHipotetis[$id_produk])) {
            $keranjangHipotetis[$id_produk]['jumlah'] += $jumlahDitambahkan;
        } else {
            $produkModel = new ProdukModel();
            $produk = $produkModel->find($id_produk);

SELECT *
FROM `promo`
WHERE `status` = 'aktif'
 LIMIT 1
---
        }

        $promoModel = new PromoModel();
        $promoAktif = $promoModel->where('status', 'aktif')->first();

INSERT INTO `pemesanan` (`order_id`, `id_user`, `tanggal`, `diskon`, `id_promo`, `total_harga`, `status`, `email_status`, `Alamat`, `Provinsi`, `Kota`, `ongkir_biaya`, `ongkir_layanan`) VALUES ('OTELA-1755934179-5', '5', '2025-08-23 07:29:39', 0, '1', 91000, 'pending', 'menunggu', 'dwadw', 'JAWA TIMUR', 'LUMAJANG', 81000, 'Jalur Nugraha Ekakurir (JNE) (Layanan Reguler)')
---
            'estimasi_selesai' => $tanggalEstimasiSelesai, // Simpan tanggal estimasi
        ];

        $id_pemesanan = $pemesananModel->insert($dataPemesanan, true);

INSERT INTO `detail_pemesanan` (`id_pemesanan`, `id_produk`, `jumlah`, `harga_saat_pesan`, `subtotal`) VALUES (71, '1', 1, '10000', 10000)
---
                'harga_saat_pesan' => $item['harga'],
                'subtotal' => $item['harga'] * $item['jumlah'],
            ];
            $detailPemesananModel->insert($dataDetail);

SELECT *
FROM `pemesanan`
WHERE `pemesanan`.`id_pemesanan` = '71'
SELECT *
FROM `detail_pemesanan`
WHERE `id_pemesanan` = '71'
---
    public function selesaikanPesanan()
    {
        if (strtolower($this->request->getMethod()) !== 'post') {
            $method = strtoupper($this->request->getMethod());
            return redirect()->to(base_url('beranda'))->with('error', "Akses tidak valid. Metode request yang diterima: {$method}, seharusnya POST.");
        }

        $id_pemesanan = $this->request->getPost('id_pemesanan');
        $nomor_resi = $this->request->getPost('nomor_resi');
        $kurir = $this->request->getPost('kurir');

        if (empty($id_pemesanan) || empty($nomor_resi) || empty($kurir)) {
            return redirect()->back()->with('error', 'Kurir dan Nomor resi tidak boleh kosong.');
        }

        $pemesananModel = new PemesananModel();
        $detailPemesananModel = new DetailPemesananModel();
        $riwayatTransaksiModel = new RiwayatTransaksiModel();
        $produkModel = new ProdukModel();
        $db = \Config\Database::connect();

        try {
            $db->transBegin();

            $pesanan = $pemesananModel->find($id_pemesanan);
            if (!$pesanan) {
                throw new \Exception('Pesanan tidak ditemukan.');
            }

            $detailPesanan = $detailPemesananModel->where('id_pemesanan', $id_pemesanan)->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '2'
---

            $itemsForJson = [];
            foreach ($detailPesanan as $item) {
                $produk = $produkModel->find($item['id_produk']);

INSERT INTO `riwayat_transaksi` (`id_pemesanan_asli`, `order_id`, `id_user`, `tanggal_pesan`, `detail_items`, `total_harga`, `resi`, `kurir`, `tanggal_selesai`) VALUES ('71', 'OTELA-1754554716-5', '5', '2025-08-07', '[{\"nama_produk\":\"Keripik Otela Original (1000gr)\",\"jumlah\":\"3\",\"harga\":\"18000\",\"subtotal\":\"54000\"},{\"nama_produk\":\"Keripik Otela Coklat (500gr)\",\"jumlah\":\"2\",\"harga\":\"13000\",\"subtotal\":\"26000\"}]', '84000', '7264716479', 'Jalur Nugraha Ekakurir (JNE) (JNE City Courier)', '2025-08-07 08:19:24')
DELETE FROM `detail_pemesanan`
WHERE `id_pemesanan` = '71'
DELETE FROM `pemesanan`
WHERE `id_pemesanan` IN ('71')
---
                'tanggal_selesai' => date('Y-m-d H:i:s')
            ];

            $riwayatTransaksiModel->insert($dataRiwayat);
            $detailPemesananModel->where('id_pemesanan', $id_pemesanan)->delete();

SELECT *
FROM `user`
WHERE `user`.`id_user` = '5'
---
    private function _sendShippingEmail(array $dataRiwayat)
    {
        $userModel = new UserModel();
        $user = $userModel->find($dataRiwayat['id_user']);