app/Controllers/Produk.php

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '14'
SELECT *
FROM `resep_produk`
WHERE `id_produk` = '14'
---
    public function edit($id)
    {
        $resepModel = new ResepProdukModel();
        $stokModel = new StokModel();

        $data['produk'] = $this->produkModel->find($id);
        $data['resep'] = $resepModel->where('id_produk', $id)->findAll();