app/Controllers/Promo.php

UPDATE `promo` SET `status` = 'aktif'
WHERE `id_promo` = '1'
---
    public function toggleStatus($id)
    {
        $promo = $this->promoModel->find($id);

        if (!$promo) {
            return redirect()->to('/promo')->with('error', 'Promo tidak ditemukan.');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('promo');

        $newStatus = ($promo['status'] === 'aktif') ? 'tidak_aktif' : 'aktif';
        $message = 'Status promo berhasil diubah menjadi ' . $newStatus . '.';

        // Jika promo akan diaktifkan, nonaktifkan dulu semua promo lain
        // untuk memastikan hanya ada satu yang aktif.
        if ($newStatus === 'aktif') {
            $builder->update(['status' => 'tidak_aktif']);