app/Controllers/Stok.php

SELECT *
FROM `stokbahan`
---
    public function index()
    {
        $model = new StokModel();
        $model->where('jumlah <=', 2000)->set(['status' => 'Hampir Habis'])->update();
        $model->where('jumlah >', 2000)->set(['status' => 'Tersedia'])->update();
        $data['stokbahan'] = $model->findAll();